### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.custom_roles[0].azurerm_role_definition.custom_role[0] will be created
+   resource "azurerm_role_definition" "custom_role" {
+       assignable_scopes           = [
+           "/subscriptions/7143f3f4-fc39-4373-af85-bbb75d0b562a",
        ]
+       description                 = "Allows view access for Azure Sites Configuration"
+       id                          = (known after apply)
+       name                        = "CUSTOM - App Settings Reader"
+       role_definition_id          = (known after apply)
+       role_definition_resource_id = (known after apply)
+       scope                       = "/subscriptions/7143f3f4-fc39-4373-af85-bbb75d0b562a"

+       permissions {
+           actions     = [
+               "Microsoft.Web/sites/config/list/action",
+               "Microsoft.Web/sites/config/read",
            ]
+           not_actions = []
        }
    }

  # module.custom_roles[0].azurerm_role_definition.custom_role[1] will be created
+   resource "azurerm_role_definition" "custom_role" {
+       assignable_scopes           = [
+           "/subscriptions/7143f3f4-fc39-4373-af85-bbb75d0b562a",
        ]
+       description                 = "Allows edit access for Azure Sites Configuration"
+       id                          = (known after apply)
+       name                        = "CUSTOM - App Settings Admin"
+       role_definition_id          = (known after apply)
+       role_definition_resource_id = (known after apply)
+       scope                       = "/subscriptions/7143f3f4-fc39-4373-af85-bbb75d0b562a"

+       permissions {
+           actions     = [
+               "Microsoft.Web/sites/config/*",
            ]
+           not_actions = []
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>